{
  "allegations": [
    {
      "id": 1,
      "title": "Islam promotes peace, not violence",
      "description": "Islam is fundamentally a religion of peace. The Quran emphasizes peace, mercy, and justice. The word 'Islam' itself comes from 'Salaam' meaning peace. Verses about fighting are often taken out of context - they were revealed during specific historical circumstances of defense against persecution.",
      "reference": "Quran 5:32: 'Whoever kills a soul... it is as if he had slain mankind entirely.' Quran 2:190: 'Fight in the way of Allah those who fight you but do not transgress.'",
      "status": "published",
      "createdBy": "System Administrator",
      "lastUpdatedBy": "System Administrator",
      "createdAt": "2026-01-06T16:47:36.948Z",
      "updatedAt": "2026-01-06T16:47:36.948Z"
    },
    {
      "id": 2,
      "title": "Women's rights in Islam",
      "description": "Contrary to popular belief, Islam granted women rights 1400 years ago that were revolutionary for their time. Women in Islam have the right to education, property ownership, business, and choice in marriage. The Prophet Muhammad (PBUH) said: 'Seeking knowledge is obligatory for every Muslim (male and female).'",
      "reference": "Quran 4:1: 'O mankind, fear your Lord, who created you from one soul...' Quran 33:35: 'For Muslim men and women... for them Allah has prepared forgiveness and great reward.'",
      "status": "published",
      "createdBy": "System Administrator",
      "lastUpdatedBy": "System Administrator",
      "createdAt": "2026-01-06T16:47:36.948Z",
      "updatedAt": "2026-01-06T16:47:36.948Z"
    },
    {
      "id": 3,
      "title": "Jihad is a personal spiritual struggle",
      "description": "Jihad in Islam primarily refers to the personal, internal struggle against sin and striving to live a righteous life. While it can also mean defending oneself or the community, it is not synonymous with 'holy war.' The greater jihad is the struggle to improve oneself and society.",
      "reference": "Hadith: 'The best jihad is (the struggle) of a person against his own self for the sake of Allah.' Quran 29:69: 'And those who strive for Us - We will surely guide them to Our ways.'",
      "status": "published",
      "createdBy": "System Administrator",
      "lastUpdatedBy": "System Administrator",
      "createdAt": "2026-01-06T16:47:36.948Z",
      "updatedAt": "2026-01-06T16:47:36.948Z"
    },
    {
      "id": 4,
      "title": "Islamic law and human rights",
      "description": "Islamic law (Sharia) encompasses a wide range of ethical and legal guidelines. While some interpretations have been criticized, many Muslim-majority countries incorporate human rights principles within their legal frameworks. Sharia emphasizes justice, compassion, and the protection of individual rights.",
      "reference": "Quran 16:90: 'Indeed, Allah commands justice and the doing of good...' Universal Declaration of Human Rights aligns with many Islamic principles.",
      "status": "published",
      "createdBy": "System Administrator",
      "lastUpdatedBy": "System Administrator",
      "createdAt": "2026-01-06T16:47:36.948Z",
      "updatedAt": "2026-01-06T16:47:36.948Z"
    }
  ]
}